const toc = [
  {
    subsections: [
      "Почему программирование?",
      "Программирование в современном мире",
      "Кто может стать программистом?",
    ],
    title: "Введение",
  },
  {
    subsections: [
      "Чтобы стать программистом нужно закончить вуз по этой специальности",
      "Программирование слишком сложно для обычного человека",
      "Чтобы стать программистом, нужно знать математику",
      "Стать программистом после 40 нельзя",
      "Программирование — это профессия для мальчиков",
      "Все программисты работают только за компьютером весь день",
    ],
    title: "Мифы о программировании",
  },
  {
    subsections: [
      "Веб-разработка (Frontend, Backend, Fullstack)",
      "Мобильная разработка (iOS, Android)",
      "Разработка игр",
      "Встроенные системы и IoT",
      "Автоматизация и тестирование",
      "1С",
      "Не могу определиться",
    ],
    title: "Выбор направления в программировании",
  },
  {
    subsections: [
      "Программист с точки зрения компании",
      "Главный критерий успеха",
      "Готов ли я к трудоустройству?",
    ],
    title: "Как стать программистом",
  },
  {
    subsections: [
      "Выбираем направление",
      "Формируем план обучения",
      "Формируем расписание",
      "Находим единомышленников",
      "Английский язык",
    ],
    title: "С чего начать?",
  },
  {
    subsections: ["Редактор", "Отладка (дебагинг)"],
    title: "Подготовка к практике",
  },
  {
    subsections: [
      "Основы программирования",
      "Продвинутые техники",
      "Окружение",
      "Прикладные инструменты",
      "Computer Science",
      "Искусственный интеллект (ChatGPT)",
    ],
    title: "Изучение программирования",
  },
  {
    subsections: [
      "Учебные проекты",
      "Пет-проекты",
      "Открытые проекты",
      "Где искать волонтерские проекты",
    ],
    title: "Опыт прикладной разработки",
  },
  {
    subsections: [
      "Как выделиться среди других кандидатов",
      "Структура идеального резюме программиста",
      "Рекомендации по оформлению резюме",
      "Автофильтры",
    ],
    title: "Составление резюме",
  },
  {
    subsections: [
      "Где искать вакансии: платформы и сообщества",
      "Как откликаться на вакансии?",
      "Что проверяют на собеседованиях программистов?",
      "Тестовые задания",
      "Как вести переговоры о зарплате?",
      "Точечное трудоустройство",
    ],
    title: "Поиск работы и прохождение собеседований",
  },
  {
    subsections: [
      "Линкедин",
      "Сообщества (группы, помощь новичкам Q&A)",
      "Хакатоны и воркшопы",
      "Конференции",
    ],
    title: "Нетворкинг",
  },
  {
    subsections: [
      "Выбор курсов и материалов",
      "Самообразование или наставник?",
      "Избегаем выгорания",
    ],
    title: "Как учиться эффективно?",
  },
  {
    subsections: [
      "От джуниора до синьора: ключевые навыки",
      "Выбор между продуктовой и аутсорсинговой компанией",
      "Фриланс или работа в офисе?",
    ],
    title: "Развитие карьеры программиста",
  },
  {
    subsections: ["Программирование как дверь в будущее", "Советы начинающим"],
    title: "Заключение",
  },
  {
    subsections: ["Рекомендованные книги, курсы и ресурсы", "Список полезных инструментов"],
    title: "Приложения",
  },
] as const;

export default toc;
