export default {
  header: 'Вопросы и Ответы',
  main: {
    'about-project': {
      answer:
        'Это полностью бесплатная платформа для обучения it (айти) с нуля. Code Basics был создан разработчиками и сообществом школы программирования Хекслет для того, чтобы любой желающий мог попробовать себя в программировании и заложить правильный фундамент для новой профессии, основанный не на запоминании специфики, а на понимании системы в целом. Одна из ключевых фишек проекта это тренажер по программированию\n',
      question: 'Что такое Code Basics?',
    },
    'for-whom': {
      answer:
        'Курсы Code Basics подходят для всех, кто начинает изучать программирование с нуля и хочет стать профессиональным программистом. Возраст, профессия – не имеют значения. На Code Basics занимаются взрослые и подростки, технари и чистые гуманитарии.\n',
      question: 'Для кого курсы?',
    },
    'how-it-works': {
      answer:
        'Code Basics – полностью автоматизированная онлайн платформа. Поэтому вы можете заниматься в любое удобное время, когда захотите.\n\nКурсы программирования состоят из тематических блоков, в каждом есть несколько уроков. Проходите уроки последовательно: сначала изучите теорию, потом выполните практическое упражнение прямо в браузере – система проверит его автоматически.\n',
      question: 'Как проходит обучение программированию?',
    },
    'how-much': {
      answer:
        'Code Basics создавался как проект для обучения программированию с нуля бесплатно. Таким он, был, есть и будет. Более того, Code Basics это открытый проект, код которого можно не только найти на Github, но и принять участие в его разработке\n',
      question: 'Сколько стоят курсы на платформе?',
    },
    'how-to-start': {
      answer:
        'Достаточно просто зарегистрироваться. Регистрация на платформе бесплатная, после регистрации вы получите доступ ко всем курсам Code Basics. Выбирайте любой – и проходите.\n',
      question: 'Как начать пользоваться платформой?',
    },
    'if-something-goes-wrong': {
      answer:
        'Спрашивайте! В каждом уроке есть раздел «ИИ-помощник» в котором вы можете чатится с нашим ассистентом Tota AI. Здесь можно задать вопрос, уточнить условие задания, если оно кажется вам непонятным.\n\nПри выполнении практики также советуем внимательно читать вывод тестов – в нем содержится информация о том, почему решение не проходит. А еще вы можете сравнить свой результат с готовым решением. Впрочем, не советуем обращаться к нему до тех пор, пока успешно не выполните задание. Помните – вы учитесь, а не повторяете.\n',
      question: 'А если что-то не получается?',
    },
    possibilities: {
      answer:
        'Code Basics – проект с открытым исходным кодом. Участвовать в его развитии может любой практикующий разработчик. Исходный код доступен на [GitHub](https://github.com/hexlet-basics). Вы можете помочь в создании новых курсов и уроков, улучшать существующие, исправлять неточности и опечатки, переводить курсы на английский язык.\n',
      question: 'Какие возможности есть для практикующих разработчиков?',
    },
    'what-type-of-courses': {
      answer:
        'Изначально CodeBasics был ориентирован только на изучение программирования, но мы думаем о том чтобы расширить возможности платформы и добавить сюда курсы более широкого профиля, так что платформа превратится в бесплатные айти (it) курсы с нуля\n',
      question: 'Вы учите только программированию?',
    },
  },
} as const;
