export default () => {
  return (
    <>
      <h2>Что такое Code Basics</h2>

      <p>
        Это открытый бесплатный проект для изучения основ программирования.
        Интерактивные курсы с практикой рассчитаны на тех, кто только начал
        интересоваться разработкой. На Code Basics уже есть курсы по PHP, Java,
        JS, Python, Ruby, HTML, CSS, Racket, Elixir и Go.
      </p>

      <p>
        В 2020 году проект Code Basics занял 3 место на Международном конкурсе
        открытых онлайн-курсов EdCrunch Award OOC в номинации «Лучший
        внеплатформенный онлайн-курс».
      </p>

      <h2>Почему мы его создали</h2>

      <p>
        Большинство доступных материалов для новичков больше похожи на
        справочники или туториалы в стиле «повтори за учителем».
      </p>

      <p>
        Цель проекта Code Basics — грамотный старт. Мы хотим научить начинающих
        программистов лучшим стандартам кодирования, правильному именованию
        функций, пониманию систем, а не запоминанию специфики.
      </p>

      <h2>Для кого наш проект</h2>
      <ol>
        <li>
          Для новичков, которые только начинают знакомиться с синтаксисом языков
          программирования и базовыми алгоритмами.
        </li>
        <li>
          Для начинающих программистов, которые «плавают» в основах и хотят
          узнать больше, чем написано в учебниках.
        </li>
        <li>Для учителей, работающих с новичками.</li>
      </ol>
      <h2>Как можно поучаствовать в его разработке</h2>
      <p>
        Code Basics - это собственный Open Source проект команды Хекслета. Любой
        программист может поучаствовать в его разработке: улучшить уроки,
        исправить неточности и расширить курсы на другие языки программирования.
        Исходный код платформы Code Basics, всех уроков и упражнений доступен на
        GitHub.
      </p>
    </>
  );
};
