export default function AuthorsRu() {
  return (
    <>
      <p>
        При разработке курсов контент проходит определенные этапы: работа с
        автором и методистами, редакторами, дизайнерами. Ниже мы собрали
        основные рекомендации и подходы, которые используем для написания
        текстового контента.
      </p>

      <h2>Процесс</h2>
      <p>
        Чтобы начать участвовать в разработке контента, нужно пройти следующие
        шаги:
      </p>
      <ol>
        <li>
          Найти интересующий вас язык тут:{' '}
          <a href="https://github.com/hexlet-basics">
            https://github.com/hexlet-basics
          </a>
        </li>
        <li>
          Разобраться в структуре репозитория на примере выложенных на{' '}
          <a href="https://code-basics.com/ru">https://code-basics.com/ru</a>{' '}
          курсов
        </li>
        <li>Начать отсылать пулреквесты</li>
      </ol>

      <h2>Чем могут помочь наши рекомендации:</h2>
      <ul>
        <li>Структурировать свои знания</li>
        <li>Выделять смысловые блоки в тексте</li>
        <li>
          Определять уровень сложности материала в зависимости от целевой
          аудитории
        </li>
        <li>Объяснять сложные вещи простым языком</li>
        <li>Оформлять, редактировать и корректировать текст</li>
      </ul>

      <h2>Список рекомендаций</h2>
      <h3>Перед началом работы над текстом</h3>
      <ul>
        <li>
          Мы ориентируемся на инфостиль, о котором можно почитать{' '}
          <a href="https://glvrd.ru">здесь</a>
        </li>
        <li>Пройти текстовый курс «Как писать классные тексты»</li>
        <li>Пройти текстовый курс «Как проектировать классные уроки»</li>
      </ul>

      <h3>Как проверить готовый текст</h3>
      <h4>Оригинальность текста</h4>
      <p>
        В образовательном контенте ценятся тексты, в которых авторы доносят
        знания своими словами. Вы можете опираться на сторонние источники, но не
        стоит копировать из них целыми фрагментами. Будет здорово, если
        оригинальность вашего текста составит от 70% до 100%.
      </p>
      <p>Проверить свой текст можно с помощью этих сервисов:</p>
      <ul>
        <li>
          <a href="https://text.ru">Text.ru</a> — проверяет медленно, но без
          ограничений
        </li>
        <li>
          <a href="https://content-watch.ru">Content Watch</a> — проверяет
          намного быстрее, но до 10000 символов и 3 раза в день
        </li>
      </ul>

      <h4>Соответствие информационному стилю</h4>
      <ul>
        <li>
          Воспользоваться сервисом «Главред» и довести свой текст до 8 — 8.5
          баллов
        </li>
        <li>Воспользоваться нашим чек-листом:</li>
        <ul>
          <li>Урок делится на смысловые блоки с подзаголовками</li>
          <li>Подзаголовки сформулированы так, что отражают подтемы урока</li>
          <li>Соблюдается правило «Один абзац — это одна мысль»</li>
          <li>
            Тема урока раскрыта последовательно:
            <ul>
              <li>«От знакомого к незнакомому»</li>
              <li>«От простого к сложному»</li>
              <li>«От общего к частному»</li>
            </ul>
          </li>
          <li>
            Введение объясняет, как устроен урок, какие темы затронуты и почему
            эти темы важны
          </li>
          <li>Заключение подводит итоги и перечисляет ключевые тезисы</li>
        </ul>
      </ul>

      <h4>Структура абзацев и предложений</h4>
      <ul>
        <li>Нет монотонных отрывков с одинаковой длиной предложений</li>
        <li>
          Нет абзацев со скрытыми запутанными мыслями («Стоит упомянуть»,
          «обратите внимание»)
        </li>
        <li>
          Нет предложений со скрытым действием (отглагольные существительные)
        </li>
        <li>
          Нет предложений со скрытым подлежащим (пассивные, модальные и
          возвратные глаголы)
        </li>
      </ul>
    </>
  );
}
