import * as Routes from '@/routes.js';

export default function CookiePolicyEn() {
  return (
    <>
      <p>
        На посещаемом Сайте{' '}
        <a href={Routes.root_path()} target="_blank" rel="noreferrer">
          https://code-basics.com
        </a>{' '}
        и его поддоменах (далее – Сайт) используются файлы cookie.
      </p>

      <p>
        Cookie-файлы (Куки-файлы) — это небольшие фрагменты текста, которые
        передаются в браузер сайта, после просмотра его фрагментов Пользователем
        для упрощения взаимодействия с сайтом.
      </p>

      <p>
        Cookie-файлы необходимы для обеспечения работоспособности сайта,
        статистических и иных исследований на основе обезличенной информации и
        предоставлять Пользователю персонализированные рекомендации.
      </p>

      <p>
        Продолжая использовать данный Сайт или предпринимая любые другие
        действия в рамках действующего законодательства Пользователь соглашается
        с тем, что владелец данного Сайта может размещать на устройстве
        Пользователя Сookie-файлы.
      </p>

      <p>
        Используемые Сookie-файлы не сохраняют и не собирают персональные данные
        Пользователя.
      </p>

      <p>Цели использования Сookie-файлов:</p>

      <ol>
        <li>
          Оптимизация и повышения производительности работы Сайта для повышения
          его привлекательности, улучшения содержания и функциональности.
          Позволяют определять аппаратное и программное обеспечение устройства
          Пользователя.
        </li>
        <li>Подсчет количества Пользователей Сайта.</li>
        <li>
          Определение действий Пользователя совершенных им на Сайте (посещаемые
          страницы, время и количество просмотренных страниц).
        </li>
        <li>
          Сбор аналитических данных с помощью сервисов:
          <ul>
            <li>
              статистики Яндекс.Метрика{' '}
              <a
                href="https://metrika.yandex.ru/"
                target="_blank"
                rel="noreferrer"
              >
                https://metrika.yandex.ru
              </a>
              ;
            </li>
            <li>
              статистики{' '}
              <a href="https://top.mail.ru/" target="_blank" rel="noreferrer">
                https://top.mail.ru/
              </a>
              ;
            </li>
            <li>
              статистики Roistat{' '}
              <a
                href="https://roistat.com/ru/"
                target="_blank"
                rel="noreferrer"
              >
                https://roistat.com/ru/
              </a>
              ;
            </li>
            <li>
              рекламной сети adv.cake{' '}
              <a href="https://advcake.ru/" target="_blank" rel="noreferrer">
                https://advcake.ru/
              </a>
              ;
            </li>
            <li>
              рекламной сети Admitad{' '}
              <a
                href="https://www.admitad.ru/"
                target="_blank"
                rel="noreferrer"
              >
                https://www.admitad.ru/
              </a>
              ;
            </li>
            <li>
              рекламной сети ВКонтакте{' '}
              <a href="https://vk.com/" target="_blank" rel="noreferrer">
                https://vk.com/
              </a>
              ;
            </li>
          </ul>
        </li>
        <li>
          Показ целенаправленной интернет-рекламы с использованием информации,
          полученной из Сookie-файлов, для анонимного анализа использования
          Сайта с целью размещения на нем рекламной информации, предоставления
          Пользователю персональных скидок и акционных предложений.
        </li>
      </ol>

      <p>
        Пользователь вправе прекратить обработку Cookie-файлов на своем
        устройстве (компьютере, мобильном телефоне, планшете) с помощью
        соответствующих настроек браузера.
      </p>

      <p>
        Обращаем внимание, что отключение Пользователем обмена Сookie-файлами
        повлияет на использование Сайта. Отдельные функции Сайта могут стать
        недоступными
      </p>
    </>
  );
}
