export default function TosRu() {
  return (
    <>
      <p>
        Получая доступ и используя наши продукты и услуги, вы соглашаетесь
        соблюдать условия, перечисленные на этой странице.
      </p>

      <h2>Правила для создания аккаунта</h2>
      <ul>
        <li>
          Вы должны быть старше 13 лет, чтобы воспользоваться этой услугой.
        </li>
        <li>
          Вы должны быть человеком. Мы запрещаем регистрировать аккаунты ботам и
          автоматическим методам.
        </li>
        <li>
          Вы должны предоставить настоящий адрес электронной почты и любую
          другую информацию, запрашиваемую для завершения процесса регистрации.
        </li>
        <li>
          Ваш логин может использовать только один человек — один и тот же логин
          для нескольких пользователей запрещен. Вы можете создать отдельные
          учетные записи для стольких людей, сколько позволяет ваш план.
        </li>
        <li>
          Вы несете ответственность за поддержание безопасности вашей учетной
          записи и пароля. Hexlet не несет ответственности за любые убытки,
          вызванные несоблюдением этого обязательства.
        </li>
        <li>
          Вы несете ответственность за весь опубликованный контент и действия,
          которые происходят под вашей учетной записью.
        </li>
        <li>
          Одно физическое или юридическое лицо не может иметь более одной
          бесплатной учетной записи.
        </li>
        <li>
          Вы не можете использовать Сервис для любых незаконных или
          несанкционированных целей. При использовании Сервиса вы не должны
          нарушать законы вашей юрисдикции.
        </li>
      </ul>

      <h2>Отмена и прекращение</h2>
      <ul>
        <li>
          Вы несете единоличную ответственность за правильное удаление своей
          учетной записи. Вы можете запросить аннулирование вашей учетной записи
          по электронной почте службы поддержки.
        </li>
        <li>
          Hexlet может прекратить действие аккаунта или приостановить его без
          предварительного уведомления, если:
          <ul>
            <li>
              Есть обоснованные подозрения, что вы нарушили условия этого
              документа;
            </li>
            <li>
              Вас подозревают в мошеннической или незаконной деятельности;
            </li>
            <li>
              Hexlet может прекратить действие аккаунта с немедленным
              вступлением в силу с полным возмещением средств.
            </li>
          </ul>
        </li>
      </ul>

      <h2>Изменения Сервиса</h2>
      <p>
        Hexlet оставляет за собой право в любое время изменить или прекратить
        работу Сервиса с уведомлением или без него. Например, Сервис может быть
        временно отключен для технического обслуживания.
      </p>

      <h2>Авторские права</h2>
      <ul>
        <li>
          Внешний вид Сервиса защищен авторским правом © 2014 Hexlet Ltd. Все
          права защищены.
        </li>
        <li>
          Компания владеет авторскими правами на уроки, созданные сотрудниками
          или авторами по контракту.
        </li>
        <li>
          Вы не можете использовать, копировать, воспроизводить или
          распространять контент без письменного согласия владельцев.
        </li>
      </ul>

      <h2>Общие условия</h2>
      <ul>
        <li>Услуга предоставляется на условиях «как есть» и «как доступно».</li>
        <li>
          Поддержка доступна на английском и русском языках по электронной
          почте.
        </li>
        <li>
          Вы не должны изменять или взламывать Сервис, а также создавать ложное
          представление о связи с Hexlet.
        </li>
        <li>Вы не должны загружать или передавать вредоносный код.</li>
        <li>
          Hexlet использует сторонних поставщиков для предоставления
          оборудования и технологий для работы Сервиса.
        </li>
        <li>
          Если вы используете полосу пропускания выше нормы, Hexlet может
          ограничить вашу учетную запись или файловый хостинг.
        </li>
        <li>
          Hexlet не гарантирует бесперебойную работу, точность или соответствие
          Сервиса вашим ожиданиям.
        </li>
      </ul>

      <p>
        Вопросы об условиях обслуживания следует направлять на{" "}
        <a href="mailto:support@hexlet.io">support@hexlet.io</a> на английском или
        русском языке.
      </p>
      <p>Последнее обновление: 15 июня 2019 года.</p>
    </>
  );
}
