export default {
  account: {
    profiles: {
      edit: {
        confirm_delete: 'Вы уверены, что хотите удалить свой аккаунт?',
        delete: 'Удалить аккаунт',
        meta: {
          description: 'Здесь меняются личные данные',
        },
        title: 'Редактирование профиля',
      },
    },
  },
  admin: {
    blog_posts: {
      edit: {
        header: 'Редактирование %{id}',
      },
      index: {
        add_new_blog_post: 'Добавить новый пост',
        header: 'Посты в блоге',
      },
      'new': {
        header: 'Новый пост',
      },
    },
    home: {
      index: {
        dashboard: 'Кабинет',
      },
    },
    language_categories: {
      edit: {
        header: 'Редактирование %{id}',
      },
      index: {
        add_new_language: 'Добавить категорию',
        header: 'Категории',
      },
      'new': {
        header: 'Новая категория',
      },
      form: {
        main: 'Principal',
        items: 'Elementos',
        qna_items: 'Preguntas y respuestas',
      },
    },
    language_landing_pages: {
      edit: {
        header: 'Редактирование %{id}',
      },
      index: {
        add_new_language: 'Добавить лендинг',
        header: 'Лендинги',
      },
      'new': {
        header: 'Новый лендинг',
      },
    },
    language_lesson_members: {
      index: {
        header: 'Прохождение уроков',
      },
    },
    language_lesson_reviews: {
      index: {
        header: 'Ревью уроков',
        data: 'Datos',
      },
    },
    language_lessons: {
      index: {
        header: 'Уроки',
      },
    },
    languages: {
      edit: {
        header: 'Редактирование %{id}',
        versions: 'Versiones',
        load_new_version: 'Cargar nueva version',
        id: 'ID',
        result: 'Resultado',
      },
      index: {
        add_new_language: 'Добавить курс',
        header: 'Курсы',
      },
      'new': {
        header: 'Новый курс',
      },
    },
    leads: {
      index: {
        header: 'Лиды',
        data: 'Datos',
        answers: 'Respuestas',
        courses: 'Cursos',
      },
    },
    management: {
      users: {
        edit: {
          header: 'Редактирование пользователя',
          progress: 'Progreso',
          language: 'Idioma',
          count: 'Cantidad',
        },
        filter: {
          from: 'Начал прохождение с',
        },
        index: {
          finished_lessons: 'Завершенные уроки',
          header: 'Пользователи',
          search_by_email: 'Поиск по email',
        },
      },
    },
    messages: {
      index: {
        header: 'Разговоры с AI',
      },
    },
    reviews: {
      edit: {
        header: 'Редактирование %{id}',
      },
      index: {
        add_new_review: 'Добавить новый отзыв',
        header: 'Отзывы',
      },
      'new': {
        header: 'Новый отзыв',
      },
    },
    survey_answers: {
      index: {
        header: 'Ответы на опросы',
      },
    },
    survey_scenarios: {
      edit: {
        header: 'Редактирование сценария',
      },
      index: {
        header: 'Сценарии',
      },
      'new': {
        header: 'Новый сценарий',
      },
    },
    surveys: {
      edit: {
        header: 'Редактирование опроса',
      },
      index: {
        header: 'Опросы',
      },
      'new': {
        header: 'Новый опрос',
      },
    },
    title: 'Админка Code-Basics',
  },
  blocks: {
    lead_form_block: {
      description1: 'Ответим в течение дня',
      description2:
        'Нам можно написать в <a target="_blank" href="https://t.me/WelcomeCodebasicsBot">телеграм</a>',
    },
  },
  blog_posts: {
    index: {
      empty: 'Похоже, что тут пока ничего нет',
      header: 'Блог Code Basics',
      meta: {
        description:
          'Статьи об it-профессиях и технологиях для начинающих программистов, аналитиков, тестировщиков и системных администраторов',
      },
    },
    show: {
      blog_posts: 'Рекомендованные статьи',
      breadcrumbs: 'Хлебные крошки',
      courses: 'Рекомендованные курсы',
      discuss: 'Обсуждайте, помогайте и делитесь опытом',
      join_community: 'Присоединяйтесь к сообществу Хекслет',
      link: 'Перейти в сообщество',
      to_home_title: 'Домой',
    },
  },
  books: {
    show: {
      chapter: 'Глава %{number}',
      description:
        'С нуля до трудоустройства. Этот учебник — ваш путеводитель в профессию программиста. Он создан для тех, кто хочет начать с нуля и шаг за шагом дойти до трудоустройства в одной из самых востребованных и перспективных областей\n',
      download: 'Скачать книгу',
      features: {
        direction: 'Направление',
        direction_explanation:
          'Узнаете какие бывают виды разработки и языки. Куда стоит идти и почему',
        interview: 'Интервью',
        interview_explanation:
          'Подготовитесь к прохождению собеседований и испытательного срока',
        plan: 'План',
        plan_explanation:
          'Получите готовый план обучения, с темами, ресурсами для изучения и проектами',
        resume: 'Резюме',
        resume_explanation:
          'Научитесь правильно оформлять резюме и находить подходящие вакансии',
      },
      freebook: 'Бесплатная электронная книга',
      header: 'Книга: Профессия программист. С нуля до трудоустройства\n',
      request: 'Запросить книгу',
      toc: 'Содержание',
    },
  },
  cases: {
    for_teachers: {
      description:
        'Бесплатные курсы с тренажером прямо в браузере. Много практики и ИИ-ассистент',
      early_career_guidance: 'Стимулируем раннюю профориентацию:',
      early_career_guidance_list: [
        'Показываем программирование изнутри, чтобы принять взвешенное решение об изучении будущей профессии',
        'Даем возможность быстро погрузиться в язык программирования и понять, нравится ли он ученику',
        'Помогаем увидеть базовые примеры реальных задач, чтобы присмотреться к профессиональной рутине',
      ],
      header: 'Эффективное обучение школьников и студентов программированию',
      how_to_learn_programming:
        'Как пользователи изучают программирование в CodeBasics?',
      how_to_learn_programming_cards: [
        {
          title:
            'Интеграция без интеграции: чтобы внедрить CodeBasics в образовательный процесс, потребуется ПК с доступом в интернет',
          subtitle:
            'Нужно открыть браузер, зарегистрироваться и начать проходить интересующий курс',
          img: 'integration-icon',
        },
        {
          title:
            'Теория, подкрепленная практикой: на платформе уже сейчас доступны тренажеры по PHP, Java, JS, Python, Ruby, HTML, CSS, Racket, Elixir и Go',
          subtitle: 'Можно проходить несколько курсов одновременно',
          img: 'practice-icon',
        },
        {
          title:
            'Интерактивный формат: система автоматически проверяет выполненные задания, показывает ошибки и правильное решение, а также детальный вывод',
          subtitle:
            'Если что-то не получается, можно воспользоваться Решением учителя',
          img: 'interactive-format-icon',
        },
        {
          title:
            'Пользователям доступен Виртуальный наставник на основе Искусственного интеллекта',
          subtitle: '',
          img: 'discussion-icon',
        },
      ],
      integrate_into_education: 'Зачем интегрировать CodeBasics в обучение?',
      integrate_now: 'Интегрируйте CodeBasics в учебную программу сейчас!',
      interactive_approach: 'Ориентируемся на практику и интерактивный подход:',
      interactive_approach_list: [
        'Сопровождаем теоретические материалы курса практическими заданиями прямо в браузере',
        'Даем мгновенную обратную связь: показываем правильное решение, даем вывод по каждому тесту',
        'Подключаем ИИ-наставника, который объясняет ученикам теорию или суть задания',
      ],
      lay_programming_foundations:
        'CodeBasics закладывает основы программирования в интерактивной форме, за что получил 3-е место в номинации «Лучший внеплатформенный онлайн-курс» в 2020 году на Международном конкурсе открытых онлайн-курсов EdCrunch Award OOC',
      meta: {
        description:
          'Курсы программирования для детей и подростков от онлайн-школы Хекслет. Все занятия разработаны опытными педагогами и программистами, с учетом возрастных особенностей детей. Обучение программированию онлайн',
      },
      open_browser_and_sign_up: 'Просто откройте браузер и зарегистрируйтесь',
      programming_basic_list: [
        'Объясняем, как функционируют системы в общем, а не специфику технологий на старте',
        'Обучаем начинающих программистов лучшим стандартам кодирования, например правильному именованию функций',
        'Охватываем основные языки программирования и продолжаем добавлять курсы по современным технологиям',
      ],
      programming_competently: 'Закладываем основы программирования грамотно:',
      quotes_icon: 'Ковычки',
      select_course: 'Выбрать курс',
      sign_up: 'Зарегистрироваться',
      sign_up_and_start_learning:
        'Зарегистрируйтесь и начните обучать ваших учеников программированию прямо сейчас',
      title: 'Обучение программированию школьников и студентов',
      try: 'Попробовать',
    },
    index: {
      for_teachers: 'Для учителей и преподавателей',
      link: 'Перейти',
      meta: {
        description: 'Примеры использования Code Basics в разных сферах',
      },
      title: 'Кейсы',
    },
  },
  errors: {
    show: {
      codes: {
        '403': {
          description:
            'Скорее всего это административный доступ, поэтому нини :)',
          header: 'Доступ к странице закрыт',
        },
        '404': {
          description:
            'Возможно страница была удалена. Попробуйте перейти на нужную страницу через верхнее меню',
          header: 'Страница не найдена',
        },
        '500': {
          description:
            'Что-то пошло не так. Программистам уже пришла смс и они бегут к компьютеру, чтобы быстрее выкатить исправление',
          header: 'Ошибка сервера',
        },
        other: {
          description:
            'Что-то пошло не так. Мы получили уведомление и внимательно разбираемся с проблемой',
          header: 'Ошибка',
        },
      },
    },
  },
  home: {
    index: {
      all_blog_posts: 'Все статьи',
      all_reviews: 'Все отзывы',
      blog_posts: 'Блог',
      categories: 'Направления',
      consultation: 'Нужна помощь? Оставьте заявку, мы поможем',
      hero: {
        ai_count: 'ИИ-ассистент',
        ai_count_description: 'Подсказки и анализ кода',
        community_count: 'Сообщество',
        community_count_description: 'Более 8 000 тысяч человек',
        courses_count: 'Текстовые курсы',
        courses_count_description: 'теория, тренажер, решение учителя',
        fastest_way_to_start_coding:
          'С практикой в тренажере и ассистентом на базе ChatGPT',
        free_programming_courses: 'Бесплатные курсы по программированию с нуля',
        how_coding_works: 'Как работает обучение на code-basics',
        learn: 'Изучи',
        learn_xs: 'Научись программировать',
        source_code: 'Исходный код',
        try: 'К курсам →',
      },
      hexlet: 'Хекслета',
      in_development: 'Курсы в разработке',
      in_development_description:
        'Данные курсы находятся в разработке и не являются финальной версией. Вы можете помочь в разработке, прислав Pull Request в репозиторий GitHub',
      join: 'Зарегистрируйтесь и начните учиться прямо сейчас',
      meta: {
        description:
          'Быстрый способ изучить основы языков программирования Go, PHP, Java, JavaScript, Python, Typescript, Ruby, C# и многих других.\n',
      },
      reviews: 'Отзывы',
      sign_up: 'Регистрация',
      subheader: 'Для тех, кто начинает с нуля. От создателей ',
      title: 'Школа программирования для детей и взрослых',
    },
    languages: {
      courses: 'Курсы по программированию',
    },
    reviews: {
      course_html: 'Курс %{link}',
      reviews: 'Отзывы',
    },
    sitemap: {
      home: 'Главная',
      title: 'Карта сайта',
    },
    stats: {
      trusted_by:
        'Присоединись к %{count} изующих программирование с помощью Code Basics\n',
    },
  },
  language_categories: {
    index: {
      header: 'Категории курсов по программированию',
      link: 'Перейти',
      meta: {
        description:
          'Направления обучения программированию на CodeBasics. Выберите категорию, курсы которой вы бы хотели посмотреть',
      },
    },
    show: {
      header: 'Курсы в категории %{name}\n',
      meta: {
        description:
          'Выберите подходящий бесплатный курс из категории %{name} и учитесь бесплатно прямо в браузере с практикой и помощью от ИИ-ассистента',
      },
    },
  },
  languages: {
    lessons: {
      show: {
        breadcrumb: 'Хлебные крошки',
        chat: {
          community: 'Живые люди',
          disabled_html:
            'Чат временно отключен, так как вы достигли суточного лимита. А наше <a href="https://t.me/HexletLearningBot" traget="_blank">телеграм-сообещство</a> работает круглосуточно, подключайтесь :)',
          guest:
            'Привет! Я Тота и моя задача помочь в обучении. Чтобы активировать меня, нужно зарегистрироваться или залогиниться, если у вас уже есть аккаунт',
          hi: 'Привет! Меня зовут Тота и я здесь чтобы вам помочь по любым вопросам теории и практики. Спрашивайте, я всегда на связи!\n\np.s. В день доступно 7 сообщений, поэтому старайтесь задавать вопросы, только по самым важным вещам\n',
          not_available:
            'Скоро здесь будет наш ИИ помощник. Занимаемся настройкой прямо сейчас',
        },
        common_questions: [
          {
            question: 'Как с вами связаться? 🙃',
            answer:
              'Команда проекта находится в <a target="_blank" href="https://t.me/HexletLearningBot">телеграм-сообществе</a>. Там можно задать любой вопрос и повлиять на проект\n',
          },
          {
            question: 'Упражнение не проходит проверку — что делать? 😶',
            answer:
              'Если вы зашли в тупик, то самое время поговорить с нашим асситентом Тота во вкладке "ИИ-помощник":\n',
          },
          {
            question: 'В моей среде код работает, а здесь нет 🤨',
            answer:
              'Тесты устроены таким образом, что они проверяют решение разными способами и на разных данных. Часто решение работает с одними входными данными, но не работает с другими. Чтобы разобраться с этим моментом, изучите вкладку «Тесты» и внимательно посмотрите на вывод ошибок, в котором есть подсказки.\n',
          },
          {
            question: 'Мой код отличается от решения учителя 🤔',
            answer:
              'Это нормально 🙆, в программировании одну задачу можно выполнить множеством способов. Если ваш код прошел проверку, то он соответствует условиям задачи. В редких случаях бывает, что решение подогнано под тесты, но это видно сразу.\n',
          },
          {
            question: 'Прочитал урок — ничего не понятно 🙄',
            answer:
              'Создавать обучающие материалы, понятные для всех без исключения, довольно сложно. Мы очень стараемся, но всегда есть что улучшать. Если вы встретили материал, который вам непонятен, опишите проблему в обратной связи нашего [сообщества](https://t.me/HexletLearningBot)\n',
          },
        ],
        confirm:
          'Вы хотите сбросить прогресс упражнения. Текущая версия кода не сохранится — надеемся, вы уже скопировали его. Продолжаем сброс?',
        controls: {
          body: 'Сбросить прогресс. По этой кнопке можно вернуться в начало упражнения, если что-то сломалось и не чинится. Текущий код не сохранится. Если он вам еще потребуется, скопируйте его перед сбросом — например, в блокнот\n',
          header: 'Справка',
          run: 'Запустить',
        },
        definitions: 'Определения',
        discuss: 'ИИ-помощник',
        editor: 'Редактор',
        finish: 'Завершить',
        if_stuck_html:
          'Если вы столкнулись с трудностями и не знаете, что делать, задайте вопрос в нашем большом и дружном <a href="%{url}" target="_blank" rel="noopener">телеграм-сообществе</a>\n',
        instructions: 'Задание',
        issues: 'Нашли ошибку? Есть что добавить? Пулреквесты приветствуются',
        lesson: 'Урок',
        navigation: 'Навигация',
        next: 'Следующий →',
        only_for_signed_in_users:
          'Упражнение доступно только авторизованным пользователям.',
        output: 'Вывод',
        please_sign_in:
          'Пожалуйста, авторизуйтесь, это необходимо для отслеживания прогресса выполнения уроков. Если у вас ещё нет учётной записи, то сейчас самое время создать аккаунт.',
        prev: '← Предыдущий',
        profession_description: 'Коммерческий опыт и Трудоустройство',
        separator: ' — ',
        show_full_version: 'Реактор кода доступен в основной версии →',
        sign_in: 'Войти',
        sign_up_for_tracking_progress_html:
          'Чтобы не потерять достигнутые результаты, обязательно <a href="%{link}" class="text-decoration-none" target="_blank">зарегистрируйтесь</a>\n',
        solution: 'Решение',
        tests: 'Тесты',
        tips: 'Полезное',
        title: '%{lesson_name} | Уроки %{language_name}\n',
        to_home_title: 'Домой',
      },
    },
    show: {
      about_developer_community:
        'Мы знаем, как непросто начинать в IT, поэтому создали сообщество разработчиков, где вам всегда готовы помочь. Здесь можно задавать вопросы, получать поддержку, общаться с опытными специалистами и быстрее влиться в профессию',
      about_learning: 'Платформа: Теория, Практика, ИИ\n',
      ai_explanation:
        'AI объясняет темы, подсказывает, как решить задания, и помогает в любой момент — как личный наставник 24/7',
      ai_without_limits: 'Помощь AI без ограничений',
      blog_posts: 'Посты в блоге',
      breadcrumbs: 'Хлебные крошки',
      browser_practice: 'Практика в браузере',
      community_image_preview: 'Сообщество разработчиков',
      completed_html:
        'Поздравляем! Вы успешно завершили базовый курс на Code Basics. Это первый шаг в мир <b>профессиональной разработки</b>.\nЧто дальше? Посмотрите <a class="link-body-emphasis" href="https://ru.hexlet.io/courses_for_beginners?utm_source=code-basics&utm_medium=referral&utm_campaign=courses_for_beginners&utm_content=course_landing_page" target="_blank">продолжение на Хекслете</a>\n',
      continue: 'Продолжить обучение',
      'convenient format': 'Удобный формат',
      course_graduates: 'Присоединяйтесь к более чем 80 000 студентов',
      cover_image: 'Обложка курса',
      demo_description:
        'Попробуйте демо-урок без регистрации. Практика включена',
      demo_start: 'Демо-урок',
      free_course: 'Бесплатный курс для начинающих с нуля',
      hexlet_program_link: 'Профессия и Трудоустройство',
      join: 'Присоединиться',
      learning_conveniently:
        'Всё, что нужно для освоения новых тем, — на одном экране. Теория, практика и живые примеры идут рука об руку. Чёткая структура помогает учиться последовательно и не упускать важные детали',
      learning_preview: 'Предварительный просмотр обучения',
      learning_program: 'Программа обучения %{name}',
      lessons: '%{lessons_count} с практикой в браузере',
      more_than_support: 'Больше чем Поддержка',
      no_registration: 'Регистрация не требуется',
      ready: 'Готовы попробовать?',
      real_life_challenges:
        'Вам не нужно ничего устанавливать — все задания выполняются прямо в браузере. Встроенный редактор кода, консоль и автоматические тесты делают обучение комфортным. А если что-то не получается, всегда можно посмотреть решение учителя',
      registration: 'Зарегистрироваться',
      registration_description: 'Начните прямо сейчас',
      restart: 'Начать заново',
      reviews: 'Отзывы',
      see_all_courses_in_category: 'Все курсы "%{name}"',
      sign_up: 'Зарегистрироваться',
      similar_courses: 'Похожие курсы',
      sort_questions: 'Разбираем вопросы',
      start: 'Начать обучение %{name}',
      start_demo_lesson: 'Демо урок',
      to_home_title: 'Главная',
      try: 'Начать обучение',
      try_without_registration: 'Попробуйте без регистрации',
      updated_at: 'Обновлен %{date}',
      without_registration:
        'Начните обучение сразу — первые уроки доступны без аккаунта. Понравится формат — зарегистрируетесь, чтобы сохранить прогресс',
    },
    success: {
      add_review:
        'Не забудьте оставить отзыв, авторам курсов будет приятно (или не очень хехе). Это можно сделать <a target="_blank" rel="noopener noreferrer" href="https://taplink.cc/codebasics_reviews">тут</a>',
      changing_career_html:
        '<a target="_blank" class="link-body-emphasis" href="https://ru.hexlet.io/courses_for_beginners?utm_source=code-basics&utm_medium=referral&utm_campaign=courses_for_beginners&utm_content=finished_course_page">Карьера</a>: если вы хотите обучиться новой профессии\n',
      choose_your_path: '🔍 Выберите свой путь:\n',
      description:
        'Теперь у вас есть новые знания и навыки. Для кого-то это первый шаг в новую профессию, для кого-то — повышение квалификации. Что дальше?\n',
      getting_new_skill_html:
        '<a target="_blank" class="link-body-emphasis" href="https://ru.hexlet.io/courses_for_programmers?utm_source=code-basics&utm_medium=referral&utm_campaign=courses_for_beginners&utm_content=finished_course_page">Навыки и Инструменты</a>: если вы хотите прокачаться в новых для вас технологиях \n',
      header: 'Поздравляем, вы завершили курс «%{name}»!',
      home: 'На главную',
      leave_request:
        'Оставьте заявку на бесплатную консультацию — наш специалист поможет вам определиться и ответит на все вопросы. 👉',
      struggle_choosing: '💬 Не уверены, что выбрать?',
    },
  },
  leads: {
    'new': {
      description:
        'Понимаем, что выбрать направление и план обучения непросто. Заполните форму — мы подскажем, с чего начать и как двигаться дальше, учитывая ваши интересы и цели',
      do_it:
        '📝 <b>Оставьте заявку</b> — наш специалист свяжется с вами, выслушает ваши потребности и поможет подобрать оптимальный план обучения.',
      header: 'Консультация со специалистом',
      help_items: [
        'Обсудить ваши цели и интересы, чтобы понять, в каком направлении двигаться дальше',
        'Подобрать подходящие материалы и ресурсы, которые помогут вам разобраться в теме',
        'Поделиться вариантами развития, которые будут актуальны и интересны в вашей ситуации',
      ],
      how_can_we_help: '💡 Чем мы можем помочь?',
      return: 'Вернуться',
    },
  },
  my: {
    show: {
      add_review:
        'Мы будем очень признательны, если вы оставите отзывы по пройденным курсам. Это можно сделать <a target="_blank" rel="noopener noreferrer" href="https://taplink.cc/codebasics_reviews">тут</a>',
      finished: 'Завершенные курсы',
      started: 'Начатые курсы',
    },
  },
  pages: {
    parts: {
      about: {
        meta: {
          description:
            'Code Basics — качественные интерактивные уроки по программированию бесплатно и онлайн, для всех.\n',
        },
        title: 'О проекте',
      },
      authors: {
        meta: {
          description:
            'Code Basics открытый проект, в котором любой человек может стать автором курсов. Вот список шагов, которые нужно выполнить для этого.\n',
        },
        title: 'Автору',
      },
      cookie_policy: {
        meta: {
          description: 'Условия использования Cookie-файлов',
        },
        title: 'Условия использования Cookie-файлов',
      },
      privacy: {
        meta: {
          description: 'Политика конфиденциальности Code Basics',
        },
        title: 'Политика конфиденциальности',
      },
      tos: {
        meta: {
          description:
            'Условия использования образовательной платформы Code Basics',
        },
        title: 'Условия использования образовательной платформы',
      },
    },
  },
  passwords: {
    edit: {
      meta_description: 'Установить новый пароль на Code Basics',
      new_password: 'Новый пароль',
      title: 'Смена пароля',
    },
  },
  remind_passwords: {
    'new': {
      dont_have_account: 'Нет аккаунта?',
      forgot_password: 'Забыли пароль',
      login: 'Войти',
      meta_description: 'Восстановить пароль на Code Basics',
      register: 'Регистрация',
      title: 'Восстановление пароля',
      trying_to_login: 'Пытаетесь войти?',
    },
  },
  reviews: {
    index: {
      add_review:
        'Попробовали наши курсы и хотите оставить отзыв? Это можно сделать <a target="_blank" rel="noopener noreferrer" href="https://taplink.cc/codebasics_reviews">тут</a>',
      course: 'Курс %{language}',
      empty: 'Похоже, что тут пока ничего нет',
      header: 'Отзывы о Code Basics',
      meta: {
        description:
          'Честные отзывы наших студентов о курсах, процессе обучения и платформе\n',
      },
      read_more: 'Читать далее',
    },
  },
  sessions: {
    'new': {
      dont_have_account: 'Первый раз на сайте?',
      email: 'Email',
      forgot_password: 'Забыли пароль?',
      meta: {
        description: 'Войти на Code Basics',
      },
      password: 'Пароль',
      register: 'Регистрация',
      reset_password: 'Восстановить',
      sign_in: 'Вход',
      sign_in_with_github: 'Войти через GitHub',
      title: 'Вход',
    },
  },
  shared: {
    languages: {
      course_finished: 'Курс пройден!',
    },
    via_social_networks: {
      via_social_networks: 'С помощью социальных сетей',
    },
  },
  users: {
    'new': {
      confirmation_html:
        'Регистрируясь, вы соглашаетесь с <a href="%{url}" class="text-decoration-none" target="_blank">условиями использования</a>',
      demo_html:
        '<b>Зарегистрируйтесь</b> для продолжения бесплатного обучения. Так мы сможем сохранить ваш прогресс и открыть доступ к нашему ассистенту',
      have_account: 'Есть аккаунт?',
      meta: {
        description: 'Зарегистрироваться на Code Basics',
      },
      sign_in: 'Войти',
      sign_up: 'Регистрация',
      title: 'Регистрация',
    },
  },
} as const;
