const toc = [
  {
    "title": "Введение",
    "subsections": [
      "Почему программирование?",
      "Программирование в современном мире",
      "Кто может стать программистом?",
    ]
  },
  {
    "title": "Мифы о программировании",
    "subsections": [
      "Чтобы стать программистом нужно закончить вуз по этой специальности",
      "Программирование слишком сложно для обычного человека",
      "Чтобы стать программистом, нужно знать математику",
      "Стать программистом после 40 нельзя",
      "Программирование — это профессия для мальчиков",
      "Все программисты работают только за компьютером весь день"
    ]
  },
  {
    "title": "Выбор направления в программировании",
    "subsections": [
      "Веб-разработка (Frontend, Backend, Fullstack)",
      "Мобильная разработка (iOS, Android)",
      "Разработка игр",
      "Встроенные системы и IoT",
      "Автоматизация и тестирование",
      "1С",
      "Не могу определиться"
    ]
  },
  {
    "title": "Как стать программистом",
    "subsections": [
      "Программист с точки зрения компании",
      "Главный критерий успеха",
      "Готов ли я к трудоустройству?"
    ]
  },
  {
    "title": "С чего начать?",
    "subsections": [
      "Выбираем направление",
      "Формируем план обучения",
      "Формируем расписание",
      "Находим единомышленников",
      "Английский язык"
    ]
  },
  {
    "title": "Подготовка к практике",
    "subsections": [
      "Редактор",
      "Отладка (дебагинг)"
    ]
  },
  {
    "title": "Изучение программирования",
    "subsections": [
      "Основы программирования",
      "Продвинутые техники",
      "Окружение",
      "Прикладные инструменты",
      "Computer Science",
      "Искусственный интеллект (ChatGPT)"
    ]
  },
  {
    "title": "Опыт прикладной разработки",
    "subsections": [
      "Учебные проекты",
      "Пет-проекты",
      "Открытые проекты",
      "Где искать волонтерские проекты"
    ]
  },
  {
    "title": "Составление резюме",
    "subsections": [
      "Как выделиться среди других кандидатов",
      "Структура идеального резюме программиста",
      "Рекомендации по оформлению резюме",
      "Автофильтры"
    ]
  },
  {
    "title": "Поиск работы и прохождение собеседований",
    "subsections": [
      "Где искать вакансии: платформы и сообщества",
      "Как откликаться на вакансии?",
      "Что проверяют на собеседованиях программистов?",
      "Тестовые задания",
      "Как вести переговоры о зарплате?",
      "Точечное трудоустройство"
    ]
  },
  {
    "title": "Нетворкинг",
    "subsections": [
      "Линкедин",
      "Сообщества (группы, помощь новичкам Q&A)",
      "Хакатоны и воркшопы",
      "Конференции"
    ]
  },
  {
    "title": "Как учиться эффективно?",
    "subsections": [
      "Выбор курсов и материалов",
      "Самообразование или наставник?",
      "Избегаем выгорания"
    ]
  },
  {
    "title": "Развитие карьеры программиста",
    "subsections": [
      "От джуниора до синьора: ключевые навыки",
      "Выбор между продуктовой и аутсорсинговой компанией",
      "Фриланс или работа в офисе?"
    ]
  },
  {
    "title": "Заключение",
    "subsections": [
      "Программирование как дверь в будущее",
      "Советы начинающим"
    ]
  },
  {
    "title": "Приложения",
    "subsections": [
      "Рекомендованные книги, курсы и ресурсы",
      "Список полезных инструментов"
    ]
  }
] as const

export default toc
